const fetch = require('./missing-assertions')


/*
* fetch. В данном случае функция выполняет избыточные операции,
* тем самым тесты не покрывают ее полный функционал.
* Здесь так же можно обратить внимание на то, на сколько правильно
* структурирована сама функция. Как минимум здесь происходит мутация объекта,
* что добавляет новую ответственность функции, а это в свою очередь уничтожает
* ее нейминг по смыслу.
* */
test('fetch should be return Fred value', () => {
    const result = fetch(42)

    expect(result.name).toEqual('Fred');
});
