const is21 = require('./invisible-assertion')


/*
* is21. В данном случае нет явной проверки на то, что именно тестируется.
* То есть существует функция, которая выбрасывает при определенном условии ошибку.
* Нет четкой смысловой нагрузки, а так же конкретных данных которые несут в себе этот смысл.
* По факту можно было бы создать переменую/енум и т.д , который явно утверждает,
* что проверка происходит на основании возраста. исключение является частью бизнеса.
* Антипаттерны: в какой то степени enumenator
* */
test('is21 has throw error', () => {
    expect(() => {is21({ age: 2 })}).toThrow(Error);
});

test('is21 has return undefined', () => {
    expect(() => {is21({ age: 22 })}).not.toThrow(Error);
});
